#| Годовой доход | Ставка | Расчет налога |
#| :--- | :--- | :--- |
#| **До 2,4 млн руб.** | 13% | 13% от дохода |
#| **2,4 – 5 млн руб.** | 15% | 312 000 + 15% с суммы превышения |
#| **5 – 20 млн руб.** | 18% | 702 000 + 18% с суммы превышения |
#| **20 – 50 млн руб.** | 20% | 3 402 000 + 20% с суммы превышения |
#| **Свыше 50 млн руб.** | 22% | 9 402 000 + 22% с суммы превышения |

from ndfl import calculate_tax

def test_basic_ndfl():
    assert calculate_tax(200_000) == 26_000


def test_ndfl_tier_2():
    # 312 000 + 0.15 * 600_000
    assert calculate_tax(3_000_000) == 402_000

def test_ndfl_tier_3():
    # 702_000 + 0.18 * 2_000_000
    assert calculate_tax(7_000_000) == 1_062_000

def test_ndfl_tier_4():
    # 3_402_000 + 0.20 * 10_000_000
    assert calculate_tax(30_000_000) == 5_402_000

def test_ndfl_tier_5():
    # 9_402_000 + 0.22 * 20_000_000
    assert calculate_tax(70_000_000) == 13_802_000
    